In [11]:
# !pip install pymysql

In [4]:
import pymysql

In [5]:
# création d'un connexion object
conn = pymysql.connect(host="localhost", port=3306, user="lanacroft", password="74Shawie74!", db="sys")

#### ATTENTION ! Si on rencontre des problèmes lors de la création de l'objet "conn", il faut créer un nouveau superutilisateur dans la console. 
1. sudo mysql -u root -p
2. on entre le mdp de sudo
3. on entre le mdp de mysql (74Shawie74!)
4. on est alors connecté à mysql dans la console
5. on crée un nouveau user :
    CREATE USER 'nom_user'@'localhost' IDENTIFIED BY 'mdp_user';
6. On lui attribue tous les privilèges (dans le cas d'un superutilisateur uniquement):
    GRANT ALL ON *.* TO 'nom_user'@'localhost' WITH GRANT OPTION;
7. le nouveau superutilisateur est créé et on peut utiliser les infos de connexion user et password dans le "conn"

In [6]:
# on crée un curseur en utilisant le connexion object créé ci-dessus
cursor = conn.cursor()

In [5]:
# on crée une bdd nommée testdb2
cursor.execute("CREATE DATABASE IF NOT EXISTS testdb2;")

1

In [6]:
cursor.execute("CREATE DATABASE IF NOT EXISTS testdb;")

1

In [7]:
# si on utilise SHOW DATABASES, on obtient le nombre de bdd existantes dans le curseur mais pas de liste de bdd
cursor.execute("SHOW DATABASES;")

11

In [8]:
# pour obtenir une liste de bdd, il faut utiliser ensuite, une commande "fetch"
# il existe 3 types de commandes fetch :
# - cursor.fetchone() pour renvoyer un seul résultat
# - cursor.fetchmany(10) pour renvoyer, ici, 10 résultats
# - cursor.fetchall() pour renvoyer tous les résultats
# on peut aussi utiliser list(cursor) pour récupérer tout ce qu'il y a dans le curseur

# ici on va utiliser fetchall pour voir toutes les bdd
cursor.fetchall()

(('foodly',),
 ('foodly2',),
 ('information_schema',),
 ('moviz',),
 ('moviz2',),
 ('mysql',),
 ('performance_schema',),
 ('school',),
 ('sys',),
 ('testdb',),
 ('testdb2',))

In [9]:
# on supprime la bdd testdb2 avec DROP DATABASE

cursor.execute("DROP DATABASE testdb2;")

0

In [10]:
cursor.execute("SHOW DATABASES;")
cursor.fetchall()

(('foodly',),
 ('foodly2',),
 ('information_schema',),
 ('moviz',),
 ('moviz2',),
 ('mysql',),
 ('performance_schema',),
 ('school',),
 ('sys',),
 ('testdb',))

In [7]:
# on choisit la bdd à utiliser
cursor.execute("USE testdb;")

0

In [8]:
# on crée la table person en utilisant une variable person_table et ''' ''' pour que ce soit plus lisible
person_table = '''CREATE TABLE IF NOT EXISTS person (
person_id MEDIUMINT UNSIGNED,
first_name VARCHAR(50),
last_name VARCHAR(50),
age TINYINT UNSIGNED,
marital_status TINYINT(1),
country VARCHAR(75),
PRIMARY KEY(person_id)
);'''

# on exécute la requête person_table
cursor.execute(person_table)

0

In [39]:
# pour vérifier les colonnes de la table on utilise la commande DESC (=describe) puis fetchall pour afficher
cursor.execute("DESC person;")
cursor.fetchall()

(('person_id', 'mediumint unsigned', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'YES', '', None, ''),
 ('last_name', 'varchar(50)', 'YES', '', None, ''),
 ('age', 'tinyint unsigned', 'YES', '', None, ''),
 ('marital_status', 'tinyint(1)', 'YES', '', None, ''),
 ('country', 'varchar(75)', 'YES', '', None, ''))

In [9]:
# on va insérer une ligne dans notre bdd person
# on crée une variable avec la requête :
one_row = '''INSERT INTO person (
person_id, first_name, last_name, age, marital_status, country)
VALUES(6, "Betty", "Doe", 21, 1, "United States");'''

# ATTENTION : si on insère bien une valeur dans chaque colonne et dans l'ordre, on n'est pas obligés de donner
# les noms des colonnes.
# on peut simplement faire INSERT INTO person VALUES(1, "John", "smith", 23, 0, "United States");

# on exécute la requête :
cursor.execute(one_row)

1

In [12]:
# si on veut insérer plusieurs entrées :
mult_rows = '''INSERT INTO person
VALUES(2, 'Mark', 'Adams', 53, 1, 'France'),
      (3, 'Jack', 'Perry', 18, 0, 'England');'''

cursor.execute(mult_rows)

2

In [42]:
# cursor.execute("SELECT * FROM person;")

In [13]:
# update table : changement de données déjà existantes
cursor.execute("UPDATE person SET marital_status = 1 WHERE person_id = 5;")

0

In [14]:
cursor.execute("UPDATE person SET country = 'United States' WHERE person_id = 4;")

1

In [15]:
cursor.execute("UPDATE person SET country = 'USA' WHERE country = 'United States';")

1

In [16]:
cursor.execute("UPDATE person SET marital_status = 0, country = 'Italy' WHERE person_id = 4;")

1

In [17]:
requete = "SELECT * FROM person;"
cursor.execute(requete)
cursor.fetchall()

((1, 'John', 'smith', 23, 0, 'USA'),
 (2, 'Mark', 'Adams', 53, 1, 'France'),
 (3, 'Jack', 'Perry', 18, 0, 'England'),
 (4, 'Mary', 'Adams', 53, 0, 'Italy'),
 (5, 'Luke', 'Perry', 18, 1, 'England'),
 (6, 'Betty', 'Doe', 21, 1, 'USA'))

In [35]:
# cursor.execute("DROP DATABASE testdb;")

1

### EXERCICE : créer une bdd school et une table students

In [23]:
cursor.execute("CREATE DATABASE IF NOT EXISTS school;")

1

In [24]:
cursor.execute("USE school;")

0

In [25]:
student_table = '''CREATE TABLE IF NOT EXISTS students(
student_id MEDIUMINT UNSIGNED,
first_name VARCHAR(50),
last_name VARCHAR(50),
address TEXT,
state CHAR(2),
date_of_birth DATE,
phone_number BIGINT,
gender ENUM('male', 'female'),
PRIMARY KEY(student_id)
);'''

In [26]:
cursor.execute(student_table)

0

In [30]:
# vérification des colonnes datatypes de la table
cursor.execute("DESC students;")
cursor.fetchall()

(('student_id', 'mediumint unsigned', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'YES', '', None, ''),
 ('last_name', 'varchar(50)', 'YES', '', None, ''),
 ('address', 'text', 'YES', '', None, ''),
 ('state', 'char(2)', 'YES', '', None, ''),
 ('date_of_birth', 'date', 'YES', '', None, ''),
 ('phone_number', 'bigint', 'YES', '', None, ''),
 ('gender', "enum('male','female')", 'YES', '', None, ''))

In [31]:
# insérer 4 lignes d'étudiants dans la table
mult_students = '''INSERT INTO students VALUES
(1, "Luke", "Perry", '3 avenue of roses', "AL", "1997-09-15", 060503458564, "male"),
(2, "Mary", "Perry", '3 avenue of roses', "AL", "1999-04-21", 060503748974, "female"),
(3, "George", "Kennedy", '45 sunset boulevard avenue', "CA", "1977-02-09", 060868858564, "male"),
(4, "Lucy", "Jameson", '745 5th avenue', "NY", "2000-05-12", 068977034564, "female");
'''
cursor.execute(mult_students)

4

In [32]:
cursor.execute("SHOW DATABASES;")
cursor.fetchall()

(('foodly',),
 ('foodly2',),
 ('information_schema',),
 ('moviz',),
 ('moviz2',),
 ('mysql',),
 ('performance_schema',),
 ('school',),
 ('sys',),
 ('testdb',))

In [33]:
# cursor.execute("DROP TABLE students;")

In [34]:
update_student = "UPDATE students SET address = '40 sunset boulevard avenue', state = 'NY' WHERE student_id = 3;"
cursor.execute(update_student)

1

In [35]:
requete = "SELECT * FROM students;"
cursor.execute(requete)
cursor.fetchall()

((1,
  'Luke',
  'Perry',
  '3 avenue of roses',
  'AL',
  datetime.date(1997, 9, 15),
  60503458564,
  'male'),
 (2,
  'Mary',
  'Perry',
  '3 avenue of roses',
  'AL',
  datetime.date(1999, 4, 21),
  60503748974,
  'female'),
 (3,
  'George',
  'Kennedy',
  '40 sunset boulevard avenue',
  'NY',
  datetime.date(1977, 2, 9),
  60868858564,
  'male'),
 (4,
  'Lucy',
  'Jameson',
  '745 5th avenue',
  'NY',
  datetime.date(2000, 5, 12),
  68977034564,
  'female'))

**FIN DE L'EXERCICE**

In [18]:
# ATTENTION ! Toujours penser à fermer la connexion pour des questions de sécurité et de performances du serveur

conn.close()